lvx/extension/InformationRegisters/бит_СтруктурыХраненияУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтруктурыХраненияУпаковок</Name>
			<Comment>ЛТ6.3 [Микляев К.А.]</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержимоеУпаковкиПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МассаКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМ3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВсегоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/extension/InformationRegisters/бит_СтруктурыХраненияУпаковок/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Номенклатура") И ЗначениеЗаполнено(Параметры.Номенклатура) И Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	ПересчитатьОбъем();
	ПересчитатьВсегоУпаковок();

КонецПроцедуры

&НаКлиенте
Процедура ГабаритыПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИлиНомерУпаковкиПриИзменении(Элемент)
	ПересчитатьВсегоУпаковок();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПересчитатьОбъем();
	ПересчитатьВсегоУпаковок();
	ТекущийОбъект.ВсегоУпаковок = Запись.ВсегоУпаковок;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ Тогда
		ОбновитьВсегоУпаковокПоНоменклатуре(ТекущийОбъект.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьОбъем(ДлинаМм, ШиринаМм, ВысотаМм)
	Возврат Окр(ДлинаМм * ШиринаМм * ВысотаМм * 0.000000001, 3);
КонецФункции

&НаСервере
Процедура ПересчитатьОбъем()
	Если Запись.ДлинаМм = 0 Или Запись.ШиринаМм = 0 Или Запись.ВысотаМм = 0 Тогда
		Запись.ОбъемМ3 = 0;
	Иначе
		Запись.ОбъемМ3 = РассчитатьОбъем(Запись.ДлинаМм, Запись.ШиринаМм, Запись.ВысотаМм);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВсегоУпаковок()
	
	Если Не ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.ВсегоУпаковок = 0;
		Возврат;
	КонецЕсли;
	
	Запись.ВсегоУпаковок = КоличествоУпаковокНоменклатуры(Запись.Номенклатура, Запись.НомерУпаковки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КоличествоУпаковокНоменклатуры(Номенклатура, НомерУпаковки)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Структуры.НомерУпаковки) КАК КоличествоУпаковок
	|ИЗ
	|	РегистрСведений.бит_СтруктурыХраненияУпаковок КАК Структуры
	|ГДЕ
	|	Структуры.Номенклатура = &Номенклатура");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоУпаковок = Выборка.КоличествоУпаковок;
	
	Если ЗначениеЗаполнено(НомерУпаковки) И Не УпаковкаНоменклатурыСуществует(Номенклатура, НомерУпаковки) Тогда
		КоличествоУпаковок = КоличествоУпаковок + 1;
	КонецЕсли;
	
	Возврат КоличествоУпаковок;
	
КонецФункции

&НаСервереБезКонтекста
Функция УпаковкаНоменклатурыСуществует(Номенклатура, НомерУпаковки)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Структуры.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	РегистрСведений.бит_СтруктурыХраненияУпаковок КАК Структуры
	|ГДЕ
	|	Структуры.Номенклатура = &Номенклатура
	|	И Структуры.НомерУпаковки = &НомерУпаковки");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерУпаковки", НомерУпаковки);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьВсегоУпаковокПоНоменклатуре(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.бит_СтруктурыХраненияУпаковок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Прочитать();
	
	КоличествоУпаковок = НаборЗаписей.Количество();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		ЗаписьНабора.ВсегоУпаковок = КоличествоУпаковок;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
